outputs/openfoam_backup/0005/constant/probeDefinitions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      loggingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
surfaceElevationAnyName
{
    type waveGauge;

    // 沿 x 方向布置 N 个浪高仪
    pointDistribution lineDistribution;

    // 你要多少个测点（例如每 5 m 一个：1200/5 +1 = 241）
    N 241;

    // 起点/终点：y 是竖直，这里给一个固定高度（建议放在水体里，比如 y = -0.9 静水位）
    // z 放在薄域中间 0.05
    linestart (0   -0.9 0.05);
    lineend   (950 -0.9 0.05);

    // 竖直方向
    axis y;
    add       ( 0 0 0);
    // 是否拉伸（=1 表示均匀）
    stretch 1;

    // 输出频率：每一步写一次会很大，建议按物理时间写
    writeControl runTime;
    writeInterval 0.02;   // 每 0.02s 输出一次（你可改）
}



// ************************************************************************* //